## Data Quality Assessment and Data Cleaning

As part of this notebook,
* For states column there was no standardisation of data. Based on the values available the column data was standardised to remove data inconsistency.

In [6]:
import pandas as pd
df = pd.read_excel(r"C:\Users\ibeme\Downloads\Datasets\Raw_data.xlsx",sheet_name= 'CustomerAddress')

In [7]:
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [9]:
df.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [5]:
df.duplicated().sum()

0

In [9]:
df['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [10]:
df['state'] = df['state'].map({'New South Wales':'NSW','Victoria':'VIC','NSW':'NSW','VIC':'VIC','QLD':'QLD'})

In [11]:
df['state'].value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [15]:
df['country'].value_counts()

Australia    3999
Name: country, dtype: int64

In [8]:
for i in df.select_dtypes(include=object):
    print(df[i].value_counts())

3 Mariners Cove Terrace      2
3 Talisman Place             2
64 Macpherson Junction       2
359 Briar Crest Road         1
4543 Service Terrace         1
                            ..
5063 Shopko Pass             1
09 Hagan Pass                1
87897 Lighthouse Bay Pass    1
294 Lawn Junction            1
320 Acker Drive              1
Name: address, Length: 3996, dtype: int64
NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64
Australia    3999
Name: country, dtype: int64

In [12]:
df.to_csv(r"C:\Users\ibeme\Downloads\Datasets\Customer_address.csv")

In [2]:
import pandas as pd

In [18]:
cust_demo = pd.read_csv(r"C:\Users\ibeme\Downloads\Datasets\Customer_demo.csv")

In [20]:
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [21]:
cust_demo.drop('Unnamed: 0',axis=1,inplace = True)

In [22]:
cust_demo.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,70
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,43
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,70
3,4,Talbot,None,Male,33,1961-10-03,Missing,IT,Mass Customer,N,No,7.0,62
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,Missing,Affluent Customer,N,Yes,8.0,46

In [23]:
cust_demo.shape

(3912, 13)

In [24]:
df.shape #Cust address table

(3999, 6)

customer_id           3908
address               3908
postcode              3908
state                 3908
country               3908
property_valuation    3908
dtype: int64

In [31]:
master_cust_df = df.merge(cust_demo,how='right',left_on='customer_id',right_on='customer_id')